Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/government_departments/departments_of_state.html.txt.tmx
Source language: en
Languages: ga

source: There are 16 Government departments
ga: Tá 16 Ranna Rialtais ann

source: Each department is headed by a minister appointed by the Taoiseach
ga: Déanann an Taoiseach aire a cheapadh chun dul i gceannas ar gach roinn

source: You can get a list of Government Ministers and Ministers of State
ga: Tá liostaí Airí agus Airí Stáit anseo

source: Each department has a permanent staff that remains in office regardless of changes in Government
ga: Tá foireann oibre buan ag gach roinn a fhanann sa roinn fiú má thagann athrú ar an Rialtas atá i réim

source: The departments' staff are described as the civil service
ga: Tugtar an Státseirbhís ar an bhfoireann oibre buan seo

source: If you have a complaint about a decision or action of a Government department or a public body and have exhausted their internal complaints process, you may contact the Ombudsman
ga: Má tá gearán le déanamh agat faoi aon chinneadh nó aon ghníomh a dhéanann Roinn Rialtais nó aon eagraíocht phoiblí, is féidir Cosantóir an Phobail a chur ar an eolas faoi

source: Changes in the names and responsibilities of some departments were announced on 6 May 2016
ga: Fógraíodh athruithe ar ainmneacha agus ar fhreagrachtaí ranna áirithe an 6 Bealtaine 2016

source: • Department of Agriculture, Food and the Marine: This Department regulates the agriculture and food industries
ga: • An Roinn Talmhaíochta, Iascaireachtaí agus Bia: Rialaíonn an Roinn seo tionscal an bhia agus tionscal na talmhaíochta

source: • Department of Arts, Heritage, Regional, Rural and Gaeltacht Affairs: This Department promotes and protects Ireland’s heritage and culture. It also advances the use of the Irish language, supports the sustainable development of the islands and develops cultural tourism
ga: • An Roinn Ealaíon, Oidhreachta, Gnóthaí Réigiúnacha, Tuaithe agus Gaeltachta: Is iad spriocanna na Roinne seo oidhreacht agus cultúr na hÉireann a chosaint agus a chur chun cinn, úsáid na Gaeilge a chur chun cinn, tacú le forbairt inbhuanaithe na n-oileán agus turasóireacht chultúrtha a fhorbairt

source: • Department of Children and Youth Affairs: This Department is responsible for the development of harmonised policies and quality integrated service delivery for children and young people
ga: • An Roinn Leanaí agus Gnóthaí Óige: Tá an Roinn seo freagrach as forbairt ar bheartais chomhchuibhithe agus ar sheachadadh seirbhíse comhtháite do leanaí agus daoine óga

source: It carries out specific functions in the social care field and drives coordinated actions across a range of sectors, including health, education, youth justice, sport, arts and culture
ga: Déanann sí feidhmeanna sonracha sa réimse chúraim shóisialta agus treoraíonn sí gníomhartha comhordaithe thar raon earnálacha, lena n-áirítear sláinte, oideachas, ceartas óige, spórt, na healaíona agus an cultúr

source: • Department of Communications, Climate Action and Environment: This Department has responsibility for the telecommunications and broadcasting sectors
ga: • An Roinn Cumarsáide, Gníomhaithe ar son na hAeráide agus Comhshaoil. Tá an Roinn seo freagrach as na rannóga teileachumarsáide agus craolacháin

source: It promotes the development of a competitive energy supply industry and is responsible for ensuring the security and reliability of energy supply
ga: Cuireann sí tionsclaíocht iomaíoch soláthair fuinnimh chun cinn agus tá sí freagrach as sláine agus iontaofacht an tsoláthair sin

source: It also regulates, protects and develops the inland fisheries and natural resources of Ireland
ga: Tá sí freagrach, freisin, as iascaigh intíre agus acmhainní nádúrtha na hÉireann a rialú, a chosaint agus a fhorbairt

source: The Geological Survey of Ireland is linked to this Department
ga: Tá baint ag Suirbhéireacht Gheolaíoch na hÉireann leis an Roinn seo

source: • Department of Defence: This Department manages and controls the defence forces
ga: • An Roinn Cosanta. Tá cúram ár bhfórsaí cosanta ar an Roinn seo

source: • Department of Education and Skills: This Department is responsible for providing public education at primary and post-primary levels
ga: • An Roinn Oideachais agus Scileanna: Tá sé de chúram ar an Roinn seo oideachas poiblí a chur ar fáil ag leibhéal bunscoile agus iar-bhunscoile

source: It also manages State subsidies for universities and third-level colleges
ga: Déanann sí, freisin, bainistiú ar íocaíochtaí stáit d'ollscoileanna agus do choláistí triú leibhéal

source: It also has responsibility for training and the work of the Expert Group on Future Skills Needs
ga: Tá sé freagrach chomh maith as traenáil agus as obair an Ghrúpa Saineolaithe ar Riachtanais Scileanna sa Todhchaí

source: • Department of Finance: This Department is concerned with the economic and financial management of the State
ga: • An Roinn Airgeadais: Tá cúram airgeadais agus eacnamaíochta an Stáit ar an Roinn seo

source: • Department of Foreign Affairs and Trade
ga: • An Roinn Gnóthaí Eachtracha agus Trádála

source: This Department promotes and protects our interests abroad
ga: Cuireann an Roinn seo ár leasa thar lear chun cinn agus déanann sí cosaint orthu

source: It pursues peace and reconciliation on the island of Ireland
ga: Cothaíonn sí síochán agus athmhuintearas ar oileán na hÉireann

source: It is also responsible for foreign trade and development
ga: Tá sí freagrach freisin as trádáil eachtrach agus forbairt

source: • Department of Health: This Department is responsible for development of health policy and the planning of health services
ga: • An Roinn Sláinte: Tá an Roinn seo freagrach as polasaí sláinte a fhorbairt agus seirbhísí sláinte a phleanáil

source: Health services are provided by the Health Service Executive (HSE)
ga: Cuireann Feidhmeannacht na Seirbhíse Sláinte (FSS) na seirbhísí sláinte ar fáil

source: • Department of Housing, Planning, Community and Local Government: This Department has functions relating to housing and it promotes development
ga: • An Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil. Tá cúramaí ar an Roinn maidir le tithíocht agus déanann an Roinn seo forbairt a chothú

source: It oversees the local authorities
ga: Tá sí i gceannas ar údaráis áitiúla

source: • Department of Jobs, Enterprise and Innovation: This Department is responsible for the promotion and development of enterprise, employment, the protection of workers and the regulation of businesses
ga: • An Roinn Post, Fiontar agus Nuálaíochta: Tá sé de chúram ar an Roinn seo forbairt a dhéanamh ar fhiontair, ar fhostaíocht agus ar thrádáil agus tá sí freagrach freisin as oibrithe a chosaint agus gnóthaí a rialú

source: • Department of Justice and Equality: This Department aims to protect the security of the State, to prevent and tackle crime and to protect individuals' rights and freedoms
ga: • An Roinn Dlí agus Cirt, agus Comhionannais: Tá sé mar aidhm ag an Roinn seo an Stát a chosaint, coireanna a smachtú agus saoirse agus cearta an duine a chaomhnú

source: It also deals with immigration
ga: Tá cúram inimirce agus iarratais dídine uirthi freisin

source: • Department of Public Expenditure and Reform: This Department advises the Government on the overall management and control of the public sector
ga: • An Roinn Caiteachais Phoiblí agus Athchóirithe: Cuireann sí comhairle ar an Rialtas maidir le bainistiú agus smacht a bheith ar an earnáil phoiblí

source: • Department of Social Protection: This Department provides income and other support services
ga: • An Roinn Coimirce Sóisialaí: Soláthraíonn an Roinn seo seirbhísí tacaíochta ioncaim agus seirbhísí tacaíochta eile

source: It has responsibility for the provision of employment support, guidance and placement services as well as community services and the Rural Social Scheme
ga: Tá sí freagrach as soláthar seirbhísí tacaíochta fostaíochta, treorach agus socrúcháin, chomh maith le seirbhísí pobail agus an Scéim Sóisialta Tuaithe

source: It is also responsible for the payment of redundancy and insolvency payments
ga: Tá sí freagrach as íocaíochtaí iomarcaíochta agus dócmhainneachta a íoc freisin

source: This Department provides administrative and research support services to the Taoiseach and the Government
ga: Tugann an Roinn seo tacaíocht riaracháin agus taighde don Taoiseach agus don Rialtas

source: • Department of Transport, Tourism and Sport
ga: • An Roinn Iompair, Turasóireachta agus Spóirt

source: This Department is responsible for roads (other than local roads), driver testing, traffic issues, bus and rail transport, aviation policy, and road safety
ga: Tá an Roinn seo freagrach as na bóithre (seachas bóithre áitiúla), tástáil tiomána, saincheisteanna tráchta, iompar bus agus traenach, beartas eitleoireachta, agus sábháilteacht bóithre in Éirinn

source: It is also responsible for the growth of sustainable tourism and it promotes sport at local, regional, and national levels
ga: Chomh maith leis sin cuireann an Roinn spórt chun cinn ag leibhéil áitiúil, réigiúnda agus náisiúnta
